balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ32GS406.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCPC3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ADCPC3" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSRC6" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC4" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG6" edc:desc="" edc:mask="0x1" edc:name="SWTRG4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND6" edc:desc="" edc:mask="0x1" edc:name="PEND4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN6" edc:desc="" edc:mask="0x1" edc:name="IRQEN4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC7" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC5" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG7" edc:desc="" edc:mask="0x1" edc:name="SWTRG5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND7" edc:desc="" edc:mask="0x1" edc:name="PEND5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN7" edc:desc="" edc:mask="0x1" edc:name="IRQEN5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSRC60" edc:desc="" edc:mask="0x1" edc:name="TRGSRC60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC61" edc:desc="" edc:mask="0x1" edc:name="TRGSRC61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC62" edc:desc="" edc:mask="0x1" edc:name="TRGSRC62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC63" edc:desc="" edc:mask="0x1" edc:name="TRGSRC63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC64" edc:desc="" edc:mask="0x1" edc:name="TRGSRC64" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TRGSRC70" edc:desc="" edc:mask="0x1" edc:name="TRGSRC70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC71" edc:desc="" edc:mask="0x1" edc:name="TRGSRC71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC72" edc:desc="" edc:mask="0x1" edc:name="TRGSRC72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC73" edc:desc="" edc:mask="0x1" edc:name="TRGSRC73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC74" edc:desc="" edc:mask="0x1" edc:name="TRGSRC74" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="---------nnnnnnn" edc:cname="ADCPC6" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0000000" edc:name="ADCPC6" edc:nzwidth="0x10" edc:por="---------0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSRC12" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC6" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG12" edc:desc="" edc:mask="0x1" edc:name="SWTRG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND12" edc:desc="" edc:mask="0x1" edc:name="PEND6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN12" edc:desc="" edc:mask="0x1" edc:name="IRQEN6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSRC120" edc:desc="" edc:mask="0x1" edc:name="TRGSRC120" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC121" edc:desc="" edc:mask="0x1" edc:name="TRGSRC121" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC122" edc:desc="" edc:mask="0x1" edc:name="TRGSRC122" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC123" edc:desc="" edc:mask="0x1" edc:name="TRGSRC123" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC124" edc:desc="" edc:mask="0x1" edc:name="TRGSRC124" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="40"/>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF0" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF0" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF0" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF3" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF3" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF3" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
